[
  {
    "id": 7,
    "alias": "GameSys",
    "url": "https://www.virgingames.com",
    "role": "Senior Front End Developer",
    "responsibilities": null,
    "from": "January 2017",
    "to": "Current",
    "location": "Picadilly Circus, London, UK",
    "description":
      "<ul><li>Supporting the launch of virgingames.com, jackpotjoy.com and Gamesys Spanish ventures</li><li>Daily pull request reviews, weekly tech considerations, tutoring junior developers, technically advising product owners</li><li>Working on a team of senior developers to prototype future core features</li><li>Developing on, and enhancing a SSR React codebase and advocating its growth within the business</li></ul>"
  },
  {
    "id": 6,
    "alias": "BT",
    "url": "https://www.productsandservices.bt.com/products",
    "role": "Front End Development Lead",
    "responsibilities":
      "Scrum Master, Recruitment Manager, Code Quality Manager, Project Manager",
    "from": "July 2014",
    "to": "December 2016",
    "location": "St Pauls, London, UK",
    "description":
      "<ul><li>Scrum Master, Recruitment Manager, Standards Manager & JavaScript Coder</li><li>Extended AirBnB code standards and enforced lint rules into day to day development</li><li>Managed the hiring process to help hire developers, project managers and content editors (12+ people)</li><li>Technical consultation for internal, offshore and agency stake holders</li><li>Implemented Scrum into BT.com development processes</li><li>Created BT’s job standards for Front End Development</li><li>Responsible for delivering BT Mobile - a 100% online mobile store managed via internal and external APIs using React JS. Built an in-house team to experiment and deliver a solid solution for BT.com future.</li><li>Delivered many projects (as technical and development lead) to retain and entice customers; Bespoke offers, Intelligent sales system, TV redesign, Broadband redesign, BT Smart HUB 6, EE conversion"
  },
  {
    "id": 5,
    "alias": "theAudience",
    "url": "https://www.theAudience.com",
    "role": "Director of Technology",
    "responsibilities": "IT Support, Development & Project Advice",
    "from": "August 2013",
    "to": "May 2014",
    "location":
      "Soho, London, UK & Shoreditch, London UK & Hollywood, Los Angeles",
    "description":
      "<ul><li>Ensured that all users had a seamless experience during a transition between IT support companies.</li><li>Daily responsibilities included engaging with other tech companies, <strong>overseeing internal projects</strong> and providing <strong>top level feedback and guidance</strong> while developing internal apps.</li><li>Built an in house systems that could streamline HR management internally.</li></ul>"
  },
  {
    "id": 4,
    "alias": "theAudience",
    "url": "https://www.theAudience.com",
    "role": "Technical Product Owner",
    "responsibilities":
      "Team Management, PHP & JS Code Sign Off, Project Specifications & Budget",
    "from": "March 2013",
    "to": "August 2013",
    "location": "Shoreditch, London UK & Hollywood, Los Angeles",
    "description":
      "<ul><li>Following the successful launch and support of an internal CMS, I was tasked with determining end user needs to create a feedback loop for writing solid project specifications for the development team.</li><li>Generated detailed wireframes and specification documents based on user and <strong>stakeholder requirements</strong>. Also led high level pointing sessions and <strong>large scale planning</strong> to visually sell to stakeholders the expense of their decisions.</li><li>Continued to guide the new web development manager, coding daily with the team and reviewing code for project releases.</li></ul>"
  },
  {
    "id": 3,
    "alias": "theAudience",
    "url": "https://www.theAudience.com",
    "role": "Web Development Manager",
    "responsibilities":
      "PHP Coder & Engineer, Team Manager, Test Manager & Scrum Master",
    "from": "March 2011",
    "to": "March 2013",
    "location":
      "Soho, London, UK & Shoreditch, London UK & Hollywood, Los Angeles",
    "description":
      "<ul><li>Tasked with creating a custom CMS that would enable a growing team to creating curated content for clients.</li><li>Given free reign to build a team housed in the WME offices, a id investor. Built a team of freelancers & worked tirelessly to <strong>develop a system with shifting priorities</strong>. Successfully delivered in 9 months, it became a vital part of growing the business, leading to a massive expansion for the UK branch of theAudience.</li><li>Engineered a custom PHP API to create <strong>rapid prototypes</strong> and teamed it with Zend Framework codebase for the front end initially.</li><li>Switched the front end to use cutting edge technology such as alpha <strong>BackboneJS, RequireJS, UnderscoreJS and mongoDB</strong>. Expanded the system into a client facing CMS as a id stake holder and develop</li><li>Daily tasks included managing the team development, developing both JS and PHP code, running daily stand ups & planning sessions and reporting back to the project manager.</li></ul>"
  },
  {
    "id": 2,
    "alias": "LF",
    "role": "Project Lead",
    "responsibilities":
      "Zend Framework, Testing, eCommerce & High Level Project Specifications",
    "url": "",
    "from": "September 2009",
    "to": "April 2011",
    "location": "Soho, London, UK",
    "description":
      "<ul><li>Created a video on demand system using the Zend Framework and Wowza Media Service that allowed users to buy monthly memberships or per minute credits across multiple currencies. <strong>Achieved this in 5 months after given an 8 month timeline</strong>.</li><li>Created an affiliate management system that would give clients real time information on streaming information, achieved in 2 months. Was then tasked with creating a white label system for these clients, the result which was eventually bought by a large retail chain.</li><li>Daily tasks included installing Interspire Email Marketer and migrating <strong>Interspire Shopping Cart to Magento</strong>, a difficult 3 month project that taught me extensively on database engineering and table conversion.</li></ul>"
  },
  {
    "id": 1,
    "alias": "Marko Media",
    "url": "https://www.markcomedia.com",
    "role": "Web Development Manager",
    "responsibilities":
      "Hiring, Team Management, PHP Code Base Engineering & Maintenance",
    "from": "January 2007",
    "to": "September 2009",
    "location": "Croydon, London, UK",
    "description":
      "<ul><li>As a PHP developer, excelled at delivering new features more rapidly than expected; was recognized as the stronger developer on a distributed team.</li><li>Was granted request to rewrite their <strong>entire framework</strong> using my own <strong>methodologies</strong>, as I expected their system would be unable to cope with the large amount of traffic the site was beginning to generate. Managed this remotely with a team in Rotherham while opening up an office in London. Was then tasked with building a team of 10 web developers, achieved in two months.</li><li>Having built the team, was then given control of managing the entire framework and its future development to create exciting new features.</li></ul>"
  }
]
